#include <iostream>
#include "check_sin.h"

using namespace std;

#define BRED "\033[91m"
#define GREEN "\033[32m"
#define BBLUE "\033[94m"
#define RESET "\033[0m"
#define BYELLOW "\033[93m"

void sum()
{
    int n;
    cout << "Введите размер массива: ";
    cin >> n;
    if(n<=0) 
    {
        cout << BRED << "Размер должен быть строго больше нуля. Введите заново: " << RESET << endl;
        cin >> n;
    }

    double *array_A = new double[n];


    for (int i = 0; i < n; i++)
    {
        cout << BBLUE << "Ввести a[" << i << "]: " << RESET;
        cin >> array_A[i];
        cout << endl;
    }

    cout << GREEN << "Исходный массив: ";
    for(int i =0; i<n;i++)
    {
        cout << array_A[i] << " ";
    }
    cout << RESET << endl;

    bool result = any_sin_positive(array_A, n);
    cout << GREEN << "sin𝐴𝑖>0: " << result << RESET << endl;

    delete[] array_A;
}

void help()
{
    cout << GREEN << "calc\tвыводит значение\n"
         << BYELLOW << "help\tвыводит дополнительную информацию\n"
         << BRED << "quit,exit\tвыходит из проекта" << endl;
}

int main()
{
    cout << BBLUE << "Добро пожаловать!" << endl
         << "Данный проект подготовлен Юргилевич Валерией"  << endl
         << BYELLOW << "Для заданного одномерного массива A из N элементов проверить, что существует, по крайней мере, один элемент 𝐴i, для которого выполняется условие sin𝐴𝑖 >0. Рекурсивную функцию применять отдельно для каждой из половин массива. Рекурсивные вызовы заканчивать, когда останется только один элемент. " << RESET << endl
         << BRED << "Если условие выполняется, то выведется " << BYELLOW << "1" << BRED << " , если не выполняется, то выведется " << BYELLOW << "0." << RESET << endl
         << "Введите" << BBLUE << " calc" << RESET << ", если хотите вывести значение;" << BBLUE << " help" << RESET << ", если нужна дополнительная информация" << endl
         << "Если хотитие закончить проект, введите" << BBLUE << " quit или exit" << endl;
    while (true)
    {
        string command;
        cout << BYELLOW << "Введите команду: " << RESET;
        cin >> command;
        if (command == "calc")
        {
            sum();
        }
        else if (command == "help")
        {
            help();
        }
        else if (command == "quit" || command == "exit")
        {
            return 0;
        }
        else
        {
            cout << BRED << "Данная команда не найдена" << RESET << endl;
        }
    }
    return 0;
}